Can't keep curve join tangent.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId CantKeepJoinTangent { get; }
  Visual Basic
Public Shared ReadOnly Property CantKeepJoinTangent As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CantKeepJoinTangent {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurveFailures Class
  Autodesk.Revit.DB Namespace